; domain
(define (domain fo-counters-rnd)
    (:requirements :strips :typing :equality :adl :fluents)
    (:types counter)
  (:predicates
    (nop ?x - counter)
  )

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )
)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_3_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 - counter
	)
  (:init
		(= (value c0) 20)
	(= (value c1) 74)
	(= (value c2) 43)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
		)
	)
)

; plan
1. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 1 of 2
2. (increment c2)
   changed: (value c2) from 43 to 44
   goals met: 1 of 2
3. (increment c2)
   changed: (value c2) from 44 to 45
   goals met: 1 of 2
4. (increment c2)
   changed: (value c2) from 45 to 46
   goals met: 1 of 2
5. (increment c2)
   changed: (value c2) from 46 to 47
   goals met: 1 of 2
6. (increment c2)
   changed: (value c2) from 47 to 48
   goals met: 1 of 2
7. (increment c2)
   changed: (value c2) from 48 to 49
   goals met: 1 of 2
8. (increment c2)
   changed: (value c2) from 49 to 50
   goals met: 1 of 2
9. (increment c2)
   changed: (value c2) from 50 to 51
   goals met: 1 of 2
10. (increment c2)
   changed: (value c2) from 51 to 52
   goals met: 1 of 2
11. (increment c2)
   changed: (value c2) from 52 to 53
   goals met: 1 of 2
12. (increment c2)
   changed: (value c2) from 53 to 54
   goals met: 1 of 2
13. (increment c2)
   changed: (value c2) from 54 to 55
   goals met: 1 of 2
14. (increment c2)
   changed: (value c2) from 55 to 56
   goals met: 1 of 2
15. (increment c2)
   changed: (value c2) from 56 to 57
   goals met: 1 of 2
16. (increment c2)
   changed: (value c2) from 57 to 58
   goals met: 1 of 2
17. (increment c2)
   changed: (value c2) from 58 to 59
   goals met: 1 of 2
18. (increment c2)
   changed: (value c2) from 59 to 60
   goals met: 1 of 2
19. (increment c2)
   changed: (value c2) from 60 to 61
   goals met: 1 of 2
20. (increment c2)
   changed: (value c2) from 61 to 62
   goals met: 1 of 2
21. (increment c2)
   changed: (value c2) from 62 to 63
   goals met: 1 of 2
22. (increment c2)
   changed: (value c2) from 63 to 64
   goals met: 1 of 2
23. (increment c2)
   changed: (value c2) from 64 to 65
   goals met: 1 of 2
24. (increment c2)
   changed: (value c2) from 65 to 66
   goals met: 1 of 2
25. (increment c2)
   changed: (value c2) from 66 to 67
   goals met: 1 of 2
26. (increment c2)
   changed: (value c2) from 67 to 68
   goals met: 1 of 2
27. (increment c2)
   changed: (value c2) from 68 to 69
   goals met: 1 of 2
28. (increment c2)
   changed: (value c2) from 69 to 70
   goals met: 1 of 2
29. (increment c2)
   changed: (value c2) from 70 to 71
   goals met: 1 of 2
30. (increment c2)
   changed: (value c2) from 71 to 72
   goals met: 1 of 2
31. (increment c2)
   changed: (value c2) from 72 to 73
   goals met: 1 of 2
32. (increment c2)
   changed: (value c2) from 73 to 74
   goals met: 1 of 2
33. (increment c2)
   changed: (value c2) from 74 to 75
   goals met: 2 of 2
